# Создание своего репозитория
#
# 1. Создайте репозиторий на GitHub
# 2. Откройте консоль GitBash
# 3. Перейдите в директорию папки book_store_testing
# • Можно нажать ПКМ на папке в PyCharm - > Show in Explorer -> перейти в папку -> скопировать её адрес
# • Нужно заменить слеши в обратную сторону, например: C:/ваш адрес/book_store_testing
# 4. Проверьте в консоли что вы точно в той папке, узнав её содержимое
# 5. Создайте в этой директории локальный репозиторий
# 6. Добавьте в индекс все файлы этой директории
# 7. Создайте коммит с комментарием
# 8. Добавьте в систему удалённый репозиторий через git remote
# 9. Отправьте локальный репозиторий на удаленный сервер
# 10. Проверьте что файлы успешно отправились на Ваш GitHub репозиторий
#
# • При дальнейшем изменении этих файлов в PyCharm – их название будет отображаться синим цветом(так как Git их теперь отслеживает)